<html>
<head>
  <title>Javascore-Help-FinishDialog</title>
  <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1" />
  <meta name="generator" content="NoteTab Pro 4.95" />
  <meta name="author" content="Dietmar Gottke" />
</head>
<body>
<h1><font face="Arial, Helvetica, sans-serif">Java Score - 'Zieleinlauf bearbeiten' Dialogfeld</font></h1>
<p><font face="Arial, Helvetica, sans-serif"><a href="DialogFinishScr_de.html">Screenshot</a></font></p>
<p><font face="Arial, Helvetica, sans-serif">Hier werden die Zieleinl&auml;ufe eingegeben oder bearbeitet. 
  Es gibt 3 Bereiche.&nbsp; </font></p>
<p><font face="Arial, Helvetica, sans-serif"><a name="finish"></a><b>Aktueller Eintrag/Zieleinlauf</b>: 
  Dieser Anzeigebereich oben rechts zeigt die Daten des zuletzt markierten Eintrags, gleichg&uuml;ltig 
  ob dieser in der Zieleinlaufliste oder der noch nicht eintragenen Zieldurchg&auml;nger-Liste steht.</font></p>
<p><font face="Arial, Helvetica, sans-serif"><a name="unfinished"></a><b>Noch nicht als Zieldurchgang 
  eingetragen:</b> Diese Liste zeigt alle noch nicht als Zieldurchgang eingetragenen Teilnehmer.&nbsp; 
  Mit einem Doppelklick werden die Teilnehmer in den Zieleinlauf &uuml;bernommen. <strong>Das bedeutet, 
  dass die noch nicht eingetragenen Teilnehmer in der Reihenfolge ihres Zieldurchgangs doppelgeklickt 
  werden m&uuml;ssen, um sie in dieser Reihenfolge im Zieleinlauf zu haben. Dies ist wohl der normale 
  Weg Wettfahrtergebnisse in Javascore einzugeben.<br>
  </strong>(Ergebnisse k&ouml;nnen auch aus einer EXCEL oder STARCALC Liste importiert werden. <a href="DialogImportTable_de.html">Siehe</a>)</font></p>
<p><font face="Arial, Helvetica, sans-serif"><a name="finished"></a><b>Zieleinlauf</b>:&nbsp;In dieser 
  Tabelle links oben werden die Zieldurchg&auml;nger gem&auml;&szlig; ihrer eingegebenen Reihenfolge 
  angezeigt. Man kann die Segelnummern und Zielzeiten per Hand bearbeiten. Dar&uuml;berhinaus k&ouml;nnen 
  hier durch Klicken auf das Strafen-Feld ( <img src="PenaltyFlag_de.gif" width="16" height="16"> 
  ) die <strong>Strafen</strong> (DNS, DNF, DSQ usw.) eingegeben werden. Auch eine nachtr&auml;gliche 
  Verg&uuml;tung wird hier vorgenommen.<br>
  Wenn eine Zeit eingegeben wird, sollten folgende Formate eingehalten werden: hh:mm:ss, hhmmss, mmss, 
  ss. Wenn Stunden oder Minuten ausgelassen werden, wird automatisch die davor benutzte Stunde und/oder 
  Minute eingesetzt.</font></p>
<p><font face="Arial, Helvetica, sans-serif">Schaltfl&auml;chen:</font></p>
<blockquote> 
  <p><font face="Arial, Helvetica, sans-serif"><a name="insert"></a><strong>Einf&uuml;gen - </strong> 
    F&uuml;gt im Zieleinlauf eine neue freie Plazierung ein. Klicke zuerst auf die Reihe in der Zieleinlaufliste 
    wo die neue Plazierung eingef&uuml;gt werden soll, dann klicke 'Einf&uuml;gen' und die dort vorhandene 
    Zieleinlaufplazierung zusammen mit allen darunter liegenden werden eine Reihe nach unten geschoben. 
    Wenn schon alle Teilnehmer im Zieleinlauf sind, mu&szlig; zun&auml;chst der alte Eintrag gel&ouml;scht 
    und dann die neue Plazierung eingetragen werden.</font></p>
  <p><font face="Arial, Helvetica, sans-serif"><b><a name="delete"></a></b><strong>L&ouml;schen -</strong> 
    L&ouml;scht einen markierten Eintrag im Zieleinlauf und setzt ihn in die Liste &quot;Noch nicht 
    als Zieldurchgang eingetragen&quot; zur&uuml;ck.&nbsp;</font></p>
  <p><font face="Arial, Helvetica, sans-serif"><b><a name="remaining"></a>Verbleibender Zieleinlauf 
    -&nbsp;</b> Bietet eine M&ouml;glichkeit, um allen verbleibenden Teilnehmern, die nicht im Ziel 
    waren, einen gleichlautenden Zieleinlaufeintrag wie DNF o.&auml;. zuzuordnen. Mit der Schaltfl&auml;che 
    wird ein Dialog aufgerufen in dem der Zieleinlaufeintrag gew&auml;hlt werden kann. Mit einem Klick 
    darauf werden alle Teilnehmer in den Zieleinlauf &uuml;bernommen. ACHTUNG: Alle registrierten 
    Teilnehmer einer Wettfahrt m&uuml;ssen im Zieleinlauf aufgelistet sein, damit eine Wettfahrt richtig 
    ausgewertet werden kann.</font></p>
</blockquote>
<p>&nbsp;</p>
</body>
</html>
