<html>
<head>
  <title>Javascore-Help-RacePanel</title>
  <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1" />
  <meta name="generator" content="NoteTab Pro 4.95" />
  <meta name="author" content="Dietmar Gottke" />
</head>
<body>
<h1><font face="Arial, Helvetica, sans-serif">Java Score - Wettfahrten Dialogfeld</font></h1>
<p><font face="Arial, Helvetica, sans-serif"><a href="PanelRacesScr_de.html">Screenshot</a></font></p>
<p><font face="Arial, Helvetica, sans-serif">In diesem Feld werden Wettfahrten und deren Zieleinl&auml;ufe 
  bearbeitet</font><font face="Arial, Helvetica, sans-serif">.&nbsp;&nbsp;Es gibt zwei Bereiche. Links 
  werden alle Wettfahrten dieser Regatta aufgelistet und rechts stehen die Details der jeweils markierten 
  Wettfahrt.&nbsp;&nbsp;&nbsp;</font></p>
<p><font face="Arial, Helvetica, sans-serif">Zum Eingeben der Zieleinl&auml;ufe mu&szlig; auch die 
  jeweilige Wettfahrt markiert sein.</font></p>
<p><font face="Arial, Helvetica, sans-serif">Mit 'Hinzuf&uuml;gen' kann eine Wettfahrt erstellt werden.</font></p>
<p><font face="Arial, Helvetica, sans-serif">Mit 'L&ouml;schen' kann man die jeweils markierte(n) 
  Wettfahrt(en) l&ouml;schen.</font></p>
<p><font face="Arial, Helvetica, sans-serif">Wettfahrtdetails:</font></p>
<p><font face="Arial, Helvetica, sans-serif"><a name="name"></a><b>Name</b>: Name der Wettfahrt.&nbsp; 
  Standardm&auml;&szlig;ig erscheint bei Neuerstellung einer Wettfahrt eine Zahl (z.B. eine 5, wenn 
  es die 5.Wettfahrt ist). Es mu&szlig; nicht unbedingt eine Zahl sein, aber es ist dringend empfohlen 
  die Zahl oder einen Wettfahrtnamen beginnend mit dieser Zahl zu w&auml;hlen. Das tr&auml;gt wesentlich 
  zu eindeutigen Sortierungen in den Berichten bei.</font></p>
<p><font face="Arial, Helvetica, sans-serif"><b><a name="startdate"></a>Start Datum:</b> Das Startdatum 
  der Wettfahrt. F&uuml;r neue Regatten wird das Standarddatum auf heute gesetzt. Zur Auswahl eines 
  anderen Datums klappt normalerweise ein Kalender auf, in dem nur das Datum angeklickt werden mu&szlig;. 
  Falls das auf Grund einer &auml;lteren Javaversion nicht passiert, kann man das Datum auch per Hand 
  eingeben (Bitte in diesem Beispielformat: 13-Jul-2005).</font></p>
<p><font face="Arial, Helvetica, sans-serif"><b>F&uuml;r jede Klasse/Flotte</b> in der Regatta sollte 
  die nachfolgende Information eingegeben werden:</font></p>
<blockquote> 
  <p><font face="Arial, Helvetica, sans-serif"><b>Einschliessen?:</b>&nbsp; Diese Box mu&szlig; markiert 
    sein, wenn diese Klasse/Flotte in dieser Wettfahrt segelt (Achtung: Als Standardeinstellung wird 
    angenommen, das alle Klassen/Flotten dieser Regatta starten).</font></p>
  <p><font face="Arial, Helvetica, sans-serif"><a name="starttime"></a><b>Startzeit</b>&nbsp; Startzeit 
    f&uuml;r eine Klasse/Flotte. Diese Feld ist zwar optional, dient aber zur Definition von gemeinsam 
    startenden Qualifikationsgruppen o.&auml;. und zur Kalkulation von Handicap korrigierten Zeiten.</font></p>
  <p><font face="Arial, Helvetica, sans-serif"><a name="length"></a><b>Bahnl&auml;nge</b>: Die L&auml;nge 
    der Wettfahrtstrecke.&nbsp;Dieses Feld ist ebenfalls optional, kann aber zur richtigen Behandlung 
    von Handicap-Booten gebraucht werden.</font></p>
</blockquote>
<p><font face="Arial, Helvetica, sans-serif"><a name="finishes"></a><b>Zieleinlauf bearbeiten</b> 
  Schaltfl&auml;che:&nbsp; Hiermit ruft man das Dialogfeld zur Eingabe und Bearbeitung von Zieleinl&auml;ufen 
  und Strafen auf.</font></p>
<p><font face="Arial, Helvetica, sans-serif"><a name="roundings"></a><b>Rundungen bearbeiten</b> Schaltfl&auml;che:&nbsp; 
  Dies ist optional, er&ouml;ffnet aber die M&ouml;glichkeit, die Reihenfolge der Boote beim Runden 
  der Bahnmarken einzugeben. Die Bahnmarken sind numeriert und f&uuml;r jede k&ouml;nnen die Rundungen 
  eingegeben werden. (Anmerkung: Hier eingegebene Strafen werden ignoriert)</font></p>
<p><font face="Arial, Helvetica, sans-serif"><a name="comments"></a><b>Anmerkungen bearbeiten </b>Schaltfl&auml;che:&nbsp;Dies 
  ist eine optionale M&ouml;glichkeit Kommentare &uuml;ber die Wettfahrt einzugeben. Diese werden 
  bei den jeweiligen Regattaberichten oben eingef&uuml;gt. Es k&ouml;nnen HTML Tags zur Formattierung 
  benutzt werden.</font></p>
<p><font face="Arial, Helvetica, sans-serif"><a name="bfactor"></a><b>Bedingungen:</b> Dieser Set 
  von Auswahlbuttons wird f&uuml;r PHRF Time-on-Time Wertung gebraucht.&nbsp;W&auml;hle die entsprechende 
  Windbedingung. Diese Felder sind verborgen, wenn keine PHRF Klassen f&uuml;r PHRF Time on Time Wertung 
  vorgesehen sind.</font></p>
<p>&nbsp;</p>
</body>
</html>
